In [1]:
list=[1,2,3,4,5]

In [2]:
list

[1, 2, 3, 4, 5]

In [3]:
list1=[i**2 for i in list]

In [4]:
list1

[1, 4, 9, 16, 25]

In [5]:
dir(list1)

['__add__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__delitem__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__reversed__',
 '__rmul__',
 '__setattr__',
 '__setitem__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'append',
 'clear',
 'copy',
 'count',
 'extend',
 'index',
 'insert',
 'pop',
 'remove',
 'reverse',
 'sort']

In [58]:
def farenheit(T):
    return(float(9/5)*T+32)

In [59]:
farenheit(10)

50.0

In [66]:
tmp=[1,2,3,4,5]
list(1)

TypeError: 'list' object is not callable

In [61]:
List2=[]
List2.append(map(farenheit,tmp))

In [62]:
print(List2)

[<map object at 0x00000275A6DA8940>]

In [63]:
lst33=iter(List2)

In [64]:
next(lst33)

In [43]:
List3=[1,2,3,4,5]
iter(List3)
next(List3)

TypeError: 'list' object is not an iterator

TypeError: 'list' object is not an iterator

In [44]:
from platform import python_version
print(python_version())

3.7.3

In [54]:
lst=[1,2,3,4]

In [55]:
#lst1=lst.__iter__()
lst1=iter(lst)

In [57]:
next(lst1)

2

In [68]:
A=(1,2,3,34,5)

In [70]:
print(list())

TypeError: 'list' object is not callable

In [71]:
del list

In [72]:
def farenheit(T):
    return(float(9/5)*T+32)

In [73]:
tmp=[1,2,3,4,5]

In [74]:
List1=list(map(farenheit,tmp))

In [75]:
print(List1)

[33.8, 35.6, 37.4, 39.2, 41.0]

In [76]:
def Area(l,b):
    return(l*b)

In [80]:
tmp121=[1,2,3,4,5]
tmp242=[2,5,8,9,5]

In [81]:
list12=list(map(Area,tmp121,tmp242))

In [82]:
print(list12)

[2, 10, 24, 36, 25]

In [1]:
lst2=[1,2,3,4]

In [2]:
lst3=lst2.__iter__()

In [3]:
lst3

In [5]:
next(lst3)

2

In [7]:
d={'V1':'Value1'}

In [8]:
d['V2']='Value2'
d

{'V1': 'Value1', 'V2': 'Value2'}

In [10]:
d.keys()

d.items()

dict_items([('V1', 'Value1'), ('V2', 'Value2')])

In [11]:
d.values()

dict_values(['Value1', 'Value2'])

In [12]:
def greet(name,age):
    print("my name is {} and my age is {}".format(name,age))

In [13]:
greet("Jack",10)

my name is Jack and my age is 10

In [1]:
%%writefile testfile.txt
Hi I will be creating a dummy file

Writing testfile.txt

In [2]:
pwd()

'C:\\Users\\Anupam'

In [16]:
my_file=open('testfile.txt','a+')

In [17]:
my_file.write('This is hardly an actual file')

29

In [18]:
my_file.read()

''

In [19]:
for line in open('testfile.txt'):
    print(line)

This is hardly an actual fileThis is hardly an actual fileThis is hardly an actual file

In [20]:
lst4=[3,'hy','nj',9]

In [26]:
m=[]
for i in range(len(lst4),0,-1):
    m.append(i)
m

[4, 3, 2, 1]

In [33]:
m=[]
for i in range(len(lst4)-1,-1,-1):
    m.append(lst4[i])
m

[9, 'nj', 'hy', 3]

In [3]:
import pandas as pd
import numpy as np

In [144]:
dp = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
print(dp)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [145]:
np.where(dp["FlightNumber"]=='NaN')

C:\Users\Anupam\Anaconda3\lib\site-packages\pandas\core\ops.py:1649: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

(array([], dtype=int64),)

In [146]:
dp["FlightNumber"]=dp["FlightNumber"].fillna(dp["FlightNumber"].ffill()+10)
dp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [147]:
dp["FlightNumber"]=dp["FlightNumber"].astype(int)
dp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [148]:
dp[['From','To']]=dp['From_To'].str.split('_',expand=True)
dp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [149]:
len(dp["RecentDelays"].describe().top)

np.where

In [150]:
de={"Delay_1":dp["RecentDelays"][0],"Delay_2":dp["RecentDelays"][1],
                "Delay_3":dp["RecentDelays"][2],"Delay_4":dp["RecentDelays"][3],"Delay_5":dp["RecentDelays"][4]}

In [151]:
len(dp["RecentDelays"].describe().top)

for i in dp["RecentDelays"]:
    if len(i)<len(dp["RecentDelays"].describe().top):
        c=len(dp["RecentDelays"].describe().top)-len(i)
        while(c>0):
            i.append("NaN")
            c=c-1
            
print(dp["RecentDelays"])

0      [23, 47, NaN]
1    [NaN, NaN, NaN]
2       [24, 43, 87]
3     [13, NaN, NaN]
4      [67, 32, NaN]
Name: RecentDelays, dtype: object

In [152]:
de={"Delay-1":dp["RecentDelays"][0],"Delay-2":dp["RecentDelays"][1],
                "Delay-3":dp["RecentDelays"][2],"Delay-4":dp["RecentDelays"][3],"Delay-5":dp["RecentDelays"][4]}

In [153]:
dk=pd.DataFrame(de)

dk

  Delay-1 Delay-2  Delay-3 Delay-4 Delay-5
0      23     NaN       24      13      67
1      47     NaN       43     NaN      32
2     NaN     NaN       87     NaN     NaN

In [154]:
dp["Delay_1"]=dk["Delay-1"]
dp["Delay_2"]=dk["Delay-2"]
dp["Delay_3"]=dk["Delay-3"]
dp["Delay_4"]=dk["Delay-4"]
dp["Delay_5"]=dk["Delay-5"]

In [155]:
dp

,From_To,FlightNumber,RecentDelays,Airline,From,To,Delay_1,Delay_2,Delay_3,Delay_4,Delay_5
0,LoNDon_paris,10045,"[23, 47, NaN]",KLM(!),LoNDon,paris,23,NaN,24.0,13,67
1,MAdrid_miLAN,10055,"[NaN, NaN, NaN]",<Air France> (12),MAdrid,miLAN,47,NaN,43.0,NaN,32
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm,NaN,NaN,87.0,NaN,NaN
3,Budapest_PaRis,10075,"[13, NaN, NaN]",12. Air France,Budapest,PaRis,NaN,NaN,NaN,NaN,NaN
4,Brussels_londOn,10085,"[67, 32, NaN]","""Swiss Air""",Brussels,londOn,NaN,NaN,NaN,NaN,NaN

In [156]:
del dp["RecentDelays"]
dp

,From_To,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3,Delay_4,Delay_5
0,LoNDon_paris,10045,KLM(!),LoNDon,paris,23,NaN,24.0,13,67
1,MAdrid_miLAN,10055,<Air France> (12),MAdrid,miLAN,47,NaN,43.0,NaN,32
2,londON_StockhOlm,10065,(British Airways. ),londON,StockhOlm,NaN,NaN,87.0,NaN,NaN
3,Budapest_PaRis,10075,12. Air France,Budapest,PaRis,NaN,NaN,NaN,NaN,NaN
4,Brussels_londOn,10085,"""Swiss Air""",Brussels,londOn,NaN,NaN,NaN,NaN,NaN

In [157]:
dp['From_To']=dp['From_To'].str.title()
dp['From']=dp['From'].str.title()
dp['To']=dp['To'].str.title()
dp

,From_To,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3,Delay_4,Delay_5
0,London_Paris,10045,KLM(!),London,Paris,23,NaN,24.0,13,67
1,Madrid_Milan,10055,<Air France> (12),Madrid,Milan,47,NaN,43.0,NaN,32
2,London_Stockholm,10065,(British Airways. ),London,Stockholm,NaN,NaN,87.0,NaN,NaN
3,Budapest_Paris,10075,12. Air France,Budapest,Paris,NaN,NaN,NaN,NaN,NaN
4,Brussels_London,10085,"""Swiss Air""",Brussels,London,NaN,NaN,NaN,NaN,NaN

In [29]:
#df = pd.DataFrame({'Name': ['John Larter', 'Robert Junior', 'Jonny Depp'], 
  #                  'Age':[32, 34, 36]}) print("Given Dataframe is :\n",df) 
   # Adding two new columns to the existing dataframe. 
# bydefault splitting is done on the basis of single space. 
#df[['First','Last']] = df.Name.str.split(expand=True) 
   
#print("\n After adding two new columns : \n", df)

Given Dataframe is :
             Name  Age
0    John Larter   32
1  Robert Junior   34
2     Jonny Depp   36

 After adding two new columns :
             Name  Age   First    Last
0    John Larter   32    John  Larter
1  Robert Junior   34  Robert  Junior
2     Jonny Depp   36   Jonny    Depp